uhnp/src/Documents/УправлениеЛимитами/УправлениеЛимитами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УправлениеЛимитами</name>
  <registerRecords>InformationRegister.УдалитьУстановкаЛимитовПоДаннымБюджетированияСостояния</registerRecords>
  <registerRecords>InformationRegister.СостояниеУстановкиЛимитовОбъектами</registerRecords>
  <registerRecords>AccumulationRegister.ОперацииБюджетов</registerRecords>
  <registerRecords>InformationRegister.СостояниеПериодовЛимитирования</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьЛимитыПоБюджетам</registerRecords>
  <registerRecords>InformationRegister.УдалитьСостояниеПериодовЛимитирования</registerRecords>
  <registerRecords>InformationRegister.УстановкаЛимитовПоДаннымБюджетированияСостояния</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийУправлениеЛимитами</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоГода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>УОП</name>
      <type>
        <types>DocumentRef.УправлениеПериодомСценария</types>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/УстановкаЛимитовПоДаннымБюджетированияЗначенияПоказателей/УстановкаЛимитовПоДаннымБюджетированияЗначенияПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановкаЛимитовПоДаннымБюджетированияЗначенияПоказателей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеВалюта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьЗначениеВВалютеРаскрытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>Область</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ДокументБюджетирования</name>
    <type>
      <types>DefinedType.ДокументыБюджетирования</types>
    </type>
  </resources>
  <resources>
    <name>УОП</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </resources>
  <resources>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УправлениеЛимитами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования/УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования</name>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаЛимитирования</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЛимитированияЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УправлениеЛимитами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитированияСтатейБюджетов/УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитированияСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитированияСтатейБюджетов</name>
  <resources>
    <name>КонтролироватьСтатью</name>
    <comment>(УХ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику3</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику4</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику5</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАналитику6</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УправлениеЛимитами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УстановкаЛимитовПоДаннымБюджетированияПараметрыБюджетирования/УстановкаЛимитовПоДаннымБюджетированияПараметрыБюджетирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановкаЛимитовПоДаннымБюджетированияПараметрыБюджетирования</name>
  <resources>
    <name>УОП</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </resources>
  <resources>
    <name>Регламент</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСогласования</name>
    <type>
      <types>EnumRef.СостоянияОтчетов</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УправлениеЛимитами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументБюджетирования</name>
    <type>
      <types>DefinedType.ДокументыБюджетирования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/АктуальностьУстановленныхЛимитов/АктуальностьУстановленныхЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуальностьУстановленныхЛимитов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыБюджетированияИУправлениеЛимитами</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Область</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УОП</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыОперацийУправлениеЛимитами/ВидыОперацийУправлениеЛимитами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийУправлениеЛимитами</name>
  <enumValues>
    <name>УстановкаЛимитовПоИсточнику</name>
  </enumValues>
  <enumValues>
    <name>ОтменаУстановкиЛимитов</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеПериодовЛимитирования</name>
  </enumValues>
  <enumValues>
    <name>ОткрытиеПериодовЛимитирования</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/УправлениеЛимитами/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУХ.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	// Очистка лишних реквизитов
	Если ВидОперации <> Перечисления.ВидыОперацийУправлениеЛимитами.УстановкаЛимитовПоИсточнику Тогда
		
		Для Каждого Строка Из Данные Цикл
			Строка.УОП = Документы.УправлениеПериодомСценария.ПустаяСсылка();
			Строка.Сценарий = Справочники.Сценарии.ПустаяСсылка();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения <> Тип("Структура") Тогда
		ПараметрДанныеЗаполнения = ДанныеЗаполнения;
		ДанныеЗаполнения = Новый Структура;
	КонецЕсли;
	
	Если ТипДанныхЗаполнения = Тип("ТаблицаЗначений") Тогда
		Данные.Загрузить(ПараметрДанныеЗаполнения);
	ИначеЕсли ДанныеЗаполнения.Свойство("Данные") Тогда
		ТипДанных = ТипЗнч(ДанныеЗаполнения.Данные);
		Если ТипДанных = Тип("ТаблицаЗначений") Тогда
			Данные.Загрузить(ДанныеЗаполнения.Данные);
		ИначеЕсли ТипДанных = Тип("Массив") Тогда
			Для Каждого Строка Из ДанныеЗаполнения.Данные Цикл
				ЗаполнитьЗначенияСвойств(Данные.Добавить(), Строка, "ВидБюджета, ЦФО, Проект, ПериодЛимитирования, УОП, Сценарий");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ДанныеЗаполнения.Свойство("Ответственный") Тогда
		ДанныеЗаполнения.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	КонецЕсли;
	
	Если Не ДанныеЗаполнения.Свойство("Дата") Тогда
		ДанныеЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ВидОперации <> Перечисления.ВидыОперацийУправлениеЛимитами.УстановкаЛимитовПоИсточнику Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Данные.УОП");
		МассивНепроверяемыхРеквизитов.Добавить("Данные.Сценарий");
	КонецЕсли;
	
	// Удаляем
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ПроверитьДублированиеСтрок(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	МСФОУХ.ПроверитьРучныеКорректировкиДокумента(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСерверУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.УправлениеЛимитами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	// Подготовка наборов записей
	ПроведениеСерверУХ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	// Движения по регистрам
	Документы.УправлениеЛимитами.ОтразитьСостояниеПериодовЛимитирования(ДополнительныеСвойства, Движения, Отказ);
	Документы.УправлениеЛимитами.ОтразитьСостояниеУстановки(ДополнительныеСвойства, Движения, Отказ);
	ПланированиеПотребностей.ОтразитьОперацииБюджетов(ДополнительныеСвойства, Движения, Отказ);
	
	УстановитьАктуальностьЛимитов(ДополнительныеСвойства);
	
	// Контроль результатов проведения.
	ПроведениеСерверУХ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);   
	ПроведениеСерверУХ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУХ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

	Если Документы.УправлениеЛимитами.ПоследующиеДокументы(Ссылка).Количество() > 0 Тогда
		
		ШаблонСообщения = НСтр("ru = 'Существуют документы, установившие лимиты после текущего документа (%1). Отмена проведения невозможна.'");
		ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Ссылка),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	УдалитьАктуальностьЛимитовПоДокументу(Ссылка);
	
	// Установка лимитов по данным бюджетирования
	НаборЗаписей = РегистрыСведений.УстановкаЛимитовПоДаннымБюджетированияЗначенияПоказателей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);	
	НаборЗаписей.Записать();
	
	// Параметры лимитирования
	НаборЗаписей = РегистрыСведений.УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Записать();
	
	// Статьи
	НаборЗаписей = РегистрыСведений.УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитированияСтатейБюджетов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Записать();
	
	// Параметры бюджетирования
	НаборЗаписей = РегистрыСведений.УстановкаЛимитовПоДаннымБюджетированияПараметрыБюджетирования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьАктуальностьЛимитов(ДополнительныеСвойства)
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАктуальностьУстановленныхЛимитов;
	
	УдалитьАктуальностьЛимитовПоДокументу(Ссылка);
	Если ВидОперации = Перечисления.ВидыОперацийУправлениеЛимитами.УстановкаЛимитовПоИсточнику Тогда
		Для Каждого СтрокаАктуальности Из Таблица Цикл
			МЗ = РегистрыСведений.АктуальностьУстановленныхЛимитов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, СтрокаАктуальности);
			МЗ.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьАктуальностьЛимитовПоДокументу(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктуальностьУстановленныхЛимитов.Период КАК Период,
	|	АктуальностьУстановленныхЛимитов.Организация КАК Организация,
	|	АктуальностьУстановленныхЛимитов.ВидОтчета КАК ВидОтчета,
	|	АктуальностьУстановленныхЛимитов.Область КАК Область,
	|	АктуальностьУстановленныхЛимитов.Проект КАК Проект,
	|	АктуальностьУстановленныхЛимитов.УОП КАК УОП,
	|	АктуальностьУстановленныхЛимитов.Предназначение КАК Предназначение,
	|	АктуальностьУстановленныхЛимитов.Актуальность КАК Актуальность,
	|	АктуальностьУстановленныхЛимитов.Документ КАК Документ,
	|	АктуальностьУстановленныхЛимитов.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.АктуальностьУстановленныхЛимитов КАК АктуальностьУстановленныхЛимитов
	|ГДЕ
	|	АктуальностьУстановленныхЛимитов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ = РегистрыСведений.АктуальностьУстановленныхЛимитов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьДублированиеСтрок(Отказ)
	
	// Проверка наличия дублей
	ШаблонПутиПоля = "Объект.Данные[%1]";
	ИменаРеквизитов = "ЦФО, Проект, ПериодЛимитирования";
	ТаблицаДанных = Данные.Выгрузить();
	ЦФОПроектПериод = ТаблицаДанных.Скопировать(, ИменаРеквизитов);
	ЦФОПроектПериод.Свернуть(ИменаРеквизитов, "");
	
	ШаблонСообщения = НСтр("ru = 'Значения строки %1 совпадают со значениями  одной или нескольких других строк. Устраните дублирование данных и повторите операцию.'");
	
	СтруктураПоиска = Новый Структура(ИменаРеквизитов);
	Для Каждого Строка Из ЦФОПроектПериод Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
		
		СтрокиДанных = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
		Если СтрокиДанных.Количество() > 1 Тогда
			
			Для Каждого СтрокаДанных Из СтрокиДанных Цикл
				
				ПутьКПолю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПутиПоля, СтрокаДанных.НомерСтроки-1);
				
				ТекстСообщенияПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СтрокаДанных.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю, , ПутьКПолю + ".Сценарий", , Отказ);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
